MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX564F064H.PIC
      <edc:SFRDef edc:_addr="0x1F881060" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-01166_TDAA_int_evic.Module" edc:_refcount="1" edc:access="nnnnnn---nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC0" edc:desc="" edc:grp="INT" edc:impl="0xfc7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000---00000000000000000000000" edc:name="IEC0" edc:nzwidth="0x20" edc:por="000000---00000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIE" edc:desc="" edc:mask="0x1" edc:name="CTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS0IE" edc:desc="" edc:mask="0x1" edc:name="CS0IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS1IE" edc:desc="" edc:mask="0x1" edc:name="CS1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC5IE" edc:desc="" edc:mask="0x1" edc:name="IC5IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC5IE" edc:desc="" edc:mask="0x1" edc:name="OC5IE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U1EIE" edc:desc="" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1RXIE" edc:desc="" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1TXIE" edc:desc="" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIE" edc:desc="" edc:mask="0x1" edc:name="I2C1BIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIE" edc:desc="" edc:mask="0x1" edc:name="I2C1SIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIE" edc:desc="" edc:mask="0x1" edc:name="I2C1MIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x1a"/>
            <edc:SFRFieldDef edc:cname="U1AEIE" edc:desc="" edc:mask="0x1" edc:name="U1AEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1ARXIE" edc:desc="" edc:mask="0x1" edc:name="U1ARXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1ATXIE" edc:desc="" edc:mask="0x1" edc:name="U1ATXIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0x1a"/>
            <edc:SFRFieldDef edc:cname="SPI3EIE" edc:desc="" edc:mask="0x1" edc:name="SPI3EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI3RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI3TXIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:AdjustPoint edc:offset="0x1a"/>
            <edc:SFRFieldDef edc:cname="SPI1AEIE" edc:desc="" edc:mask="0x1" edc:name="SPI1AEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI1ARXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1ARXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI1ATXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1ATXIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:AdjustPoint edc:offset="0x1a"/>
            <edc:SFRFieldDef edc:cname="I2C3BIE" edc:desc="" edc:mask="0x1" edc:name="I2C3BIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIE" edc:desc="" edc:mask="0x1" edc:name="I2C3SIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIE" edc:desc="" edc:mask="0x1" edc:name="I2C3MIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.4">
            <edc:AdjustPoint edc:offset="0x1a"/>
            <edc:SFRFieldDef edc:cname="I2C1ABIE" edc:desc="" edc:mask="0x1" edc:name="I2C1ABIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1ASIE" edc:desc="" edc:mask="0x1" edc:name="I2C1ASIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1AMIE" edc:desc="" edc:mask="0x1" edc:name="I2C1AMIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.5">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
